/*                                                                  */
/* Licensed Materials - Property of IBM                             */
/*                                                                  */
/* Blue Gene/Q                                                      */
/*                                                                  */
/* (c) Copyright IBM Corp. 2011, 2012 All Rights Reserved           */
/*                                                                  */
/* US Government Users Restricted Rights - Use, duplication or      */
/* disclosure restricted by GSA ADP Schedule Contract with IBM      */
/* Corporation.                                                     */
/*                                                                  */
/* This software is available to you under either the GNU General   */
/* Public License (GPL) version 2 or the Eclipse Public License     */
/* (EPL) at your discretion.                                        */
/*                                                                  */

#ifndef   _BEDRAM_DCR__H_ // Prevent multiple inclusion
#define   _BEDRAM_DCR__H_
  
__BEGIN_DECLS
  
#include <hwi/include/common/bgq_bitnumbers.h>
#include <hwi/include/bqc/dcr_support.h>
  
#define BEDRAM_DCR_base    (0x04C000)  // Base address for all instances
#define BEDRAM_DCR_size    (0x0012)    // Size of instance (largest offset + 1 )
  
#define BEDRAM_DCR(reg) _DCR_REG(BEDRAM_DCR, reg)
  
// Register:

#define BEDRAM_DCR__BEDRAM_INTERRUPT_STATUS_CONTROL_HIGH__BEDRAM_NON_PRIV_get(x)       _BGQ_GET(2,27,x)
#define BEDRAM_DCR__BEDRAM_INTERRUPT_STATUS_CONTROL_HIGH__BEDRAM_NON_PRIV_set(v)       _BGQ_SET(2,27,v)
#define BEDRAM_DCR__BEDRAM_INTERRUPT_STATUS_CONTROL_HIGH__BEDRAM_NON_PRIV_insert(x,v)  _BGQ_INSERT(2,27,x,v)


#define BEDRAM_DCR__BEDRAM_INTERRUPT_STATUS_CONTROL_HIGH__LOCAL_RING_width        2
#define BEDRAM_DCR__BEDRAM_INTERRUPT_STATUS_CONTROL_HIGH__LOCAL_RING_position     29
#define BEDRAM_DCR__BEDRAM_INTERRUPT_STATUS_CONTROL_HIGH__LOCAL_RING_get(x)       _BGQ_GET(2,29,x)
#define BEDRAM_DCR__BEDRAM_INTERRUPT_STATUS_CONTROL_HIGH__LOCAL_RING_set(v)       _BGQ_SET(2,29,v)
#define BEDRAM_DCR__BEDRAM_INTERRUPT_STATUS_CONTROL_HIGH__LOCAL_RING_insert(x,v)  _BGQ_INSERT(2,29,x,v)

  
// Interrupt Control Register: interrupt_internal_error_control_high
//   Permission: Privileged and TestInt
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH_offset         (0x000A) // Offset of Control register in instance

#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_width        2
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_position     1
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_get(x)       _BGQ_GET(2,1,x)
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_set(v)       _BGQ_SET(2,1,v)
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_insert(x,v)  _BGQ_INSERT(2,1,x,v)


#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_width        2
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_position     3
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_get(x)       _BGQ_GET(2,3,x)
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_set(v)       _BGQ_SET(2,3,v)
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_insert(x,v)  _BGQ_INSERT(2,3,x,v)


#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_width        2
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_position     5
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_get(x)       _BGQ_GET(2,5,x)
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_set(v)       _BGQ_SET(2,5,v)
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_insert(x,v)  _BGQ_INSERT(2,5,x,v)


#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_width        2
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_position     7
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_get(x)       _BGQ_GET(2,7,x)
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_set(v)       _BGQ_SET(2,7,v)
#define BEDRAM_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_insert(x,v)  _BGQ_INSERT(2,7,x,v)

#ifndef __ASSEMBLY__

typedef struct bedram_dcr { 
    /* 0x0000 */ uint64_t bedram_control;
    /* 0x0001 */ uint64_t bedram_interrupt_status__state;
    /* 0x0002 */ uint64_t bedram_interrupt_status_control_low;
    /* 0x0003 */ uint64_t bedram_interrupt_status_control_high;
    /* 0x0004 */ uint64_t bedram_interrupt_status__force;
    /* 0x0005 */ uint64_t bedram_interrupt_status__first;
    /* 0x0006 */ uint64_t bedram_interrupt_status__machine_check;
    /* 0x0007 */ uint64_t bedram_interrupt_status__critical;
    /* 0x0008 */ uint64_t bedram_interrupt_status__noncritical;
    /* 0x0009 */ uint64_t interrupt_internal_error__state;
    /* 0x000A */ uint64_t interrupt_internal_error_control_high;
    /* 0x000B */ uint64_t interrupt_internal_error__force;
    /* 0x000C */ uint64_t interrupt_internal_error__first;
    /* 0x000D */ uint64_t interrupt_internal_error__machine_check;
    /* 0x000E */ uint64_t interrupt_internal_error__critical;
    /* 0x000F */ uint64_t interrupt_internal_error__noncritical;
    /* 0x0010 */ uint64_t interrupt_internal_error_sw_info;
    /* 0x0011 */ uint64_t interrupt_internal_error_hw_info;
} bedram_dcr_t;
  
#define BEDRAM_DCR_USER_PTR _DCR_USER_PTR(bedram_dcr_t, BEDRAM_DCR)
#define BEDRAM_DCR_PRIV_PTR _DCR_PRIV_PTR(bedram_dcr_t, BEDRAM_DCR)
  
#endif // !__ASSEMBLY__
  
__END_DECLS
  
#endif // add nothing below this line.
