/*                                                                  */
/* Licensed Materials - Property of IBM                             */
/*                                                                  */
/* Blue Gene/Q                                                      */
/*                                                                  */
/* (c) Copyright IBM Corp. 2011, 2012 All Rights Reserved           */
/*                                                                  */
/* US Government Users Restricted Rights - Use, duplication or      */
/* disclosure restricted by GSA ADP Schedule Contract with IBM      */
/* Corporation.                                                     */
/*                                                                  */
/* This software is available to you under either the GNU General   */
/* Public License (GPL) version 2 or the Eclipse Public License     */
/* (EPL) at your discretion.                                        */
/*                                                                  */

#ifndef   _EN_DCR__H_ // Prevent multiple inclusion
#define   _EN_DCR__H_
  
__BEGIN_DECLS
  
#include <hwi/include/common/bgq_bitnumbers.h>
#include <hwi/include/bqc/dcr_support.h>
  
#define EN_DCR_base    (0x0DC000)  // Base address for all instances
#define EN_DCR_size    (0x0049)    // Size of instance (largest offset + 1 )
  
#define EN_DCR(reg) _DCR_REG(EN_DCR, reg)
  
// Register:
//   Name:        en0_thresholds

#define EN_DCR__ENVMON_INTERRUPT_STATE_CONTROL_HIGH__TVSENSE_EXCEEDS_MAX_position     29
#define EN_DCR__ENVMON_INTERRUPT_STATE_CONTROL_HIGH__TVSENSE_EXCEEDS_MAX_get(x)       _BGQ_GET(2,29,x)
#define EN_DCR__ENVMON_INTERRUPT_STATE_CONTROL_HIGH__TVSENSE_EXCEEDS_MAX_set(v)       _BGQ_SET(2,29,v)
#define EN_DCR__ENVMON_INTERRUPT_STATE_CONTROL_HIGH__TVSENSE_EXCEEDS_MAX_insert(x,v)  _BGQ_INSERT(2,29,x,v)


#define EN_DCR__ENVMON_INTERRUPT_STATE_CONTROL_HIGH__TVSENSE_LESSTHAN_MIN_width        2
#define EN_DCR__ENVMON_INTERRUPT_STATE_CONTROL_HIGH__TVSENSE_LESSTHAN_MIN_position     31
#define EN_DCR__ENVMON_INTERRUPT_STATE_CONTROL_HIGH__TVSENSE_LESSTHAN_MIN_get(x)       _BGQ_GET(2,31,x)
#define EN_DCR__ENVMON_INTERRUPT_STATE_CONTROL_HIGH__TVSENSE_LESSTHAN_MIN_set(v)       _BGQ_SET(2,31,v)
#define EN_DCR__ENVMON_INTERRUPT_STATE_CONTROL_HIGH__TVSENSE_LESSTHAN_MIN_insert(x,v)  _BGQ_INSERT(2,31,x,v)

  
// Interrupt Control Register: interrupt_internal_error_control_high
//   Permission: Read: All; Write: Privileged and TestInt
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH_offset         (0x0041) // Offset of Control register in instance

#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_width        2
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_position     1
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_get(x)       _BGQ_GET(2,1,x)
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_set(v)       _BGQ_SET(2,1,v)
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_insert(x,v)  _BGQ_INSERT(2,1,x,v)


#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_width        2
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_position     3
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_get(x)       _BGQ_GET(2,3,x)
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_set(v)       _BGQ_SET(2,3,v)
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_insert(x,v)  _BGQ_INSERT(2,3,x,v)


#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_width        2
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_position     5
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_get(x)       _BGQ_GET(2,5,x)
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_set(v)       _BGQ_SET(2,5,v)
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_insert(x,v)  _BGQ_INSERT(2,5,x,v)


#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_width        2
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_position     7
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_get(x)       _BGQ_GET(2,7,x)
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_set(v)       _BGQ_SET(2,7,v)
#define EN_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_insert(x,v)  _BGQ_INSERT(2,7,x,v)

#ifndef __ASSEMBLY__

typedef struct en_dcr { 
    /* 0x0000 */ uint64_t en0_thresholds;
    /* 0x0001 */ uint64_t en1_thresholds;
    /* 0x0002 */ uint64_t en2_thresholds;
    /* 0x0003 */ uint64_t en3_thresholds;
    /* 0x0004 */ uint64_t en4_thresholds;
    /* 0x0005 */ uint64_t en5_mask;
    /* 0x0006 */ uint64_t en_control;
    /* 0x0007 */ uint64_t reserve_0007[0x0009];
    /* 0x0010 */ uint64_t en0_input;
    /* 0x0011 */ uint64_t en1_input;
    /* 0x0012 */ uint64_t en2_input;
    /* 0x0013 */ uint64_t en3_input;
    /* 0x0014 */ uint64_t en4_input;
    /* 0x0015 */ uint64_t en5_input;
    /* 0x0016 */ uint64_t parity;
    /* 0x0017 */ uint64_t tvsense;
    /* 0x0018 */ uint64_t FSM_debug;
    /* 0x0019 */ uint64_t reserve_0019[0x000B];
    /* 0x0024 */ uint64_t user;
    /* 0x0025 */ uint64_t tvsense_thresholds;
    /* 0x0026 */ uint64_t reserve_0026[0x000A];
    /* 0x0030 */ uint64_t envmon_interrupt_state__state;
    /* 0x0031 */ uint64_t envmon_interrupt_state_control_low;
    /* 0x0032 */ uint64_t envmon_interrupt_state_control_high;
    /* 0x0033 */ uint64_t envmon_interrupt_state__force;
    /* 0x0034 */ uint64_t envmon_interrupt_state__first;
    /* 0x0035 */ uint64_t envmon_interrupt_state__machine_check;
    /* 0x0036 */ uint64_t envmon_interrupt_state__critical;
    /* 0x0037 */ uint64_t envmon_interrupt_state__noncritical;
    /* 0x0038 */ uint64_t reserve_0038[0x0008];
    /* 0x0040 */ uint64_t interrupt_internal_error__state;
    /* 0x0041 */ uint64_t interrupt_internal_error_control_high;
    /* 0x0042 */ uint64_t interrupt_internal_error__force;
    /* 0x0043 */ uint64_t interrupt_internal_error__first;
    /* 0x0044 */ uint64_t interrupt_internal_error__machine_check;
    /* 0x0045 */ uint64_t interrupt_internal_error__critical;
    /* 0x0046 */ uint64_t interrupt_internal_error__noncritical;
    /* 0x0047 */ uint64_t interrupt_internal_error_sw_info;
    /* 0x0048 */ uint64_t interrupt_internal_error_hw_info;
} en_dcr_t;
  
#define EN_DCR_USER_PTR _DCR_USER_PTR(en_dcr_t, EN_DCR)
#define EN_DCR_PRIV_PTR _DCR_PRIV_PTR(en_dcr_t, EN_DCR)
  
#endif // !__ASSEMBLY__
  
__END_DECLS
  
#endif // add nothing below this line.
