/*                                                                  */
/* Licensed Materials - Property of IBM                             */
/*                                                                  */
/* Blue Gene/Q                                                      */
/*                                                                  */
/* (c) Copyright IBM Corp. 2011, 2012 All Rights Reserved           */
/*                                                                  */
/* US Government Users Restricted Rights - Use, duplication or      */
/* disclosure restricted by GSA ADP Schedule Contract with IBM      */
/* Corporation.                                                     */
/*                                                                  */
/* This software is available to you under either the GNU General   */
/* Public License (GPL) version 2 or the Eclipse Public License     */
/* (EPL) at your discretion.                                        */
/*                                                                  */

#ifndef   _SERDES_LEFT_DCR__H_ // Prevent multiple inclusion
#define   _SERDES_LEFT_DCR__H_
  
__BEGIN_DECLS
  
#include <hwi/include/common/bgq_bitnumbers.h>
#include <hwi/include/bqc/dcr_support.h>
  
#define SERDES_LEFT_DCR_base    (0x140000)  // Base address for all instances
#define SERDES_LEFT_DCR_size    (0x0159)    // Size of instance (largest offset + 1 )
  
#define SERDES_LEFT_DCR(reg) _DCR_REG(SERDES_LEFT_DCR, reg)
  

#define SERDES_LEFT_DCR__SERDES_INTERRUPT_STATE_CONTROL_HIGH__B_PLLA_LOCK_LOST_set(v)       _BGQ_SET(2,7,v)
#define SERDES_LEFT_DCR__SERDES_INTERRUPT_STATE_CONTROL_HIGH__B_PLLA_LOCK_LOST_insert(x,v)  _BGQ_INSERT(2,7,x,v)


#define SERDES_LEFT_DCR__SERDES_INTERRUPT_STATE_CONTROL_HIGH__C_PLLA_LOCK_LOST_width        2
#define SERDES_LEFT_DCR__SERDES_INTERRUPT_STATE_CONTROL_HIGH__C_PLLA_LOCK_LOST_position     9
#define SERDES_LEFT_DCR__SERDES_INTERRUPT_STATE_CONTROL_HIGH__C_PLLA_LOCK_LOST_get(x)       _BGQ_GET(2,9,x)
#define SERDES_LEFT_DCR__SERDES_INTERRUPT_STATE_CONTROL_HIGH__C_PLLA_LOCK_LOST_set(v)       _BGQ_SET(2,9,v)
#define SERDES_LEFT_DCR__SERDES_INTERRUPT_STATE_CONTROL_HIGH__C_PLLA_LOCK_LOST_insert(x,v)  _BGQ_INSERT(2,9,x,v)

  
// Interrupt Control Register: interrupt_internal_error_control_high
//   Permission: Read: All; Write: Privileged and TestInt
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH_offset         (0x0151) // Offset of Control register in instance

#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_width        2
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_position     1
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_get(x)       _BGQ_GET(2,1,x)
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_set(v)       _BGQ_SET(2,1,v)
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_insert(x,v)  _BGQ_INSERT(2,1,x,v)


#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_width        2
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_position     3
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_get(x)       _BGQ_GET(2,3,x)
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_set(v)       _BGQ_SET(2,3,v)
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_insert(x,v)  _BGQ_INSERT(2,3,x,v)


#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_width        2
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_position     5
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_get(x)       _BGQ_GET(2,5,x)
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_set(v)       _BGQ_SET(2,5,v)
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_insert(x,v)  _BGQ_INSERT(2,5,x,v)


#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_width        2
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_position     7
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_get(x)       _BGQ_GET(2,7,x)
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_set(v)       _BGQ_SET(2,7,v)
#define SERDES_LEFT_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_insert(x,v)  _BGQ_INSERT(2,7,x,v)

#ifndef __ASSEMBLY__

typedef struct serdes_left_dcr { 
    /* 0x0000 */ uint64_t rcbus[SERDES_LEFT_DCR__RCBUS_range];
    /* 0x0100 */ uint64_t rcbus_config;
    /* 0x0101 */ uint64_t sd_config;
    /* 0x0102 */ uint64_t ts_ctl_a;
    /* 0x0103 */ uint64_t ts_ctl_b;
    /* 0x0104 */ uint64_t ts_ctl_c;
    /* 0x0105 */ uint64_t reserve_0105[0x0003];
    /* 0x0108 */ uint64_t ts_align_stat_a;
    /* 0x0109 */ uint64_t ts_align_stat_b;
    /* 0x010A */ uint64_t reserve_010A[0x0006];
    /* 0x0110 */ uint64_t ts_align_stat_c;
    /* 0x0111 */ uint64_t reserve_0111[0x0003];
    /* 0x0114 */ uint64_t ts_hss_pll_stat;
    /* 0x0115 */ uint64_t reserve_0115[0x0002];
    /* 0x0117 */ uint64_t ts_hss_lane_stat;
    /* 0x0118 */ uint64_t reserve_0118[0x0008];
    /* 0x0120 */ uint64_t prbs_ctl_a;
    /* 0x0121 */ uint64_t prbs_ctl_b;
    /* 0x0122 */ uint64_t prbs_ctl_c;
    /* 0x0123 */ uint64_t reserve_0123[0x0003];
    /* 0x0126 */ uint64_t prbs_stat_a;
    /* 0x0127 */ uint64_t prbs_stat_b;
    /* 0x0128 */ uint64_t prbs_stat_c;
    /* 0x0129 */ uint64_t reserve_0129[0x0009];
    /* 0x0132 */ uint64_t error_inject_timer_val;
    /* 0x0133 */ uint64_t error_inject_limit;
    /* 0x0134 */ uint64_t error_inject_control;
    /* 0x0135 */ uint64_t serdes_interrupt_state__state;
    /* 0x0136 */ uint64_t serdes_interrupt_state_control_low;
    /* 0x0137 */ uint64_t serdes_interrupt_state_control_high;
    /* 0x0138 */ uint64_t serdes_interrupt_state__force;
    /* 0x0139 */ uint64_t serdes_interrupt_state__first;
    /* 0x013A */ uint64_t serdes_interrupt_state__machine_check;
    /* 0x013B */ uint64_t serdes_interrupt_state__critical;
    /* 0x013C */ uint64_t serdes_interrupt_state__noncritical;
    /* 0x013D */ uint64_t reserve_013D[0x0013];
    /* 0x0150 */ uint64_t interrupt_internal_error__state;
    /* 0x0151 */ uint64_t interrupt_internal_error_control_high;
    /* 0x0152 */ uint64_t interrupt_internal_error__force;
    /* 0x0153 */ uint64_t interrupt_internal_error__first;
    /* 0x0154 */ uint64_t interrupt_internal_error__machine_check;
    /* 0x0155 */ uint64_t interrupt_internal_error__critical;
    /* 0x0156 */ uint64_t interrupt_internal_error__noncritical;
    /* 0x0157 */ uint64_t interrupt_internal_error_sw_info;
    /* 0x0158 */ uint64_t interrupt_internal_error_hw_info;
} serdes_left_dcr_t;
  
#define SERDES_LEFT_DCR_USER_PTR _DCR_USER_PTR(serdes_left_dcr_t, SERDES_LEFT_DCR)
#define SERDES_LEFT_DCR_PRIV_PTR _DCR_PRIV_PTR(serdes_left_dcr_t, SERDES_LEFT_DCR)
  
#endif // !__ASSEMBLY__
  
__END_DECLS
  
#endif // add nothing below this line.
