/*                                                                  */
/* Licensed Materials - Property of IBM                             */
/*                                                                  */
/* Blue Gene/Q                                                      */
/*                                                                  */
/* (c) Copyright IBM Corp. 2011, 2012 All Rights Reserved           */
/*                                                                  */
/* US Government Users Restricted Rights - Use, duplication or      */
/* disclosure restricted by GSA ADP Schedule Contract with IBM      */
/* Corporation.                                                     */
/*                                                                  */
/* This software is available to you under either the GNU General   */
/* Public License (GPL) version 2 or the Eclipse Public License     */
/* (EPL) at your discretion.                                        */
/*                                                                  */

#ifndef   _WU_DCR__H_ // Prevent multiple inclusion
#define   _WU_DCR__H_
  
__BEGIN_DECLS
  
#include <hwi/include/common/bgq_bitnumbers.h>
#include <hwi/include/bqc/dcr_support.h>
  
#define WU_DCR_base    (0x0)  // Base address for all instances
#define WU_DCR_size    (0x03FD)    // Size of instance (largest offset + 1 )
  
#define WU_DCR(reg) _DCR_REG(WU_DCR, reg)
  
// Register:
//   Name:        wac_match0

#define WU_DCR__INTERRUPT_INTERNAL_ERROR__BAD_PRIV_insert(x,v)  _BGQ_INSERT(1,1,x,v)


#define WU_DCR__INTERRUPT_INTERNAL_ERROR__BAD_DATA_PARITY_width        1
#define WU_DCR__INTERRUPT_INTERNAL_ERROR__BAD_DATA_PARITY_position     2
#define WU_DCR__INTERRUPT_INTERNAL_ERROR__BAD_DATA_PARITY_get(x)       _BGQ_GET(1,2,x)
#define WU_DCR__INTERRUPT_INTERNAL_ERROR__BAD_DATA_PARITY_set(v)       _BGQ_SET(1,2,v)
#define WU_DCR__INTERRUPT_INTERNAL_ERROR__BAD_DATA_PARITY_insert(x,v)  _BGQ_INSERT(1,2,x,v)


#define WU_DCR__INTERRUPT_INTERNAL_ERROR__BAD_ADDRESS_PARITY_width        1
#define WU_DCR__INTERRUPT_INTERNAL_ERROR__BAD_ADDRESS_PARITY_position     3
#define WU_DCR__INTERRUPT_INTERNAL_ERROR__BAD_ADDRESS_PARITY_get(x)       _BGQ_GET(1,3,x)
#define WU_DCR__INTERRUPT_INTERNAL_ERROR__BAD_ADDRESS_PARITY_set(v)       _BGQ_SET(1,3,v)
#define WU_DCR__INTERRUPT_INTERNAL_ERROR__BAD_ADDRESS_PARITY_insert(x,v)  _BGQ_INSERT(1,3,x,v)

  
// Interrupt Control Register: interrupt_internal_error_control_high
//   Permission: Read: All; Write: Privileged Only
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH_offset         (0x005B) // Offset of Control register in instance

#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_width        2
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_position     1
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_get(x)       _BGQ_GET(2,1,x)
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_set(v)       _BGQ_SET(2,1,v)
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_insert(x,v)  _BGQ_INSERT(2,1,x,v)


#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_width        2
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_position     3
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_get(x)       _BGQ_GET(2,3,x)
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_set(v)       _BGQ_SET(2,3,v)
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_PRIV_insert(x,v)  _BGQ_INSERT(2,3,x,v)


#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_width        2
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_position     5
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_get(x)       _BGQ_GET(2,5,x)
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_set(v)       _BGQ_SET(2,5,v)
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_DATA_PARITY_insert(x,v)  _BGQ_INSERT(2,5,x,v)


#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_width        2
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_position     7
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_get(x)       _BGQ_GET(2,7,x)
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_set(v)       _BGQ_SET(2,7,v)
#define WU_DCR__INTERRUPT_INTERNAL_ERROR_CONTROL_HIGH__BAD_ADDRESS_PARITY_insert(x,v)  _BGQ_INSERT(2,7,x,v)

#ifndef __ASSEMBLY__

typedef struct wu_dcr { 
    /* 0x0000 */ uint64_t reserve_0000[0x005A];
    /* 0x005A */ uint64_t interrupt_internal_error__state;
    /* 0x005B */ uint64_t interrupt_internal_error_control_high;
    /* 0x005C */ uint64_t interrupt_internal_error__force;
    /* 0x005D */ uint64_t interrupt_internal_error__first;
    /* 0x005E */ uint64_t interrupt_internal_error__machine_check;
    /* 0x005F */ uint64_t interrupt_internal_error__critical;
    /* 0x0060 */ uint64_t interrupt_internal_error__noncritical;
    /* 0x0061 */ uint64_t interrupt_internal_error_sw_info;
    /* 0x0062 */ uint64_t interrupt_internal_error_hw_info;
    /* 0x0063 */ uint64_t interrupt_internal_error_data_info;
    /* 0x0064 */ uint64_t reserve_0064[0x031C];
    /* 0x0380 */ uint64_t wac_match0;
    /* 0x0381 */ uint64_t reserve_0381[0x0003];
    /* 0x0384 */ uint64_t wac_mask0;
    /* 0x0385 */ uint64_t reserve_0385[0x0003];
    /* 0x0388 */ uint64_t wac_match1;
    /* 0x0389 */ uint64_t reserve_0389[0x0003];
    /* 0x038C */ uint64_t wac_mask1;
    /* 0x038D */ uint64_t reserve_038D[0x0003];
    /* 0x0390 */ uint64_t wac_match2;
    /* 0x0391 */ uint64_t reserve_0391[0x0003];
    /* 0x0394 */ uint64_t wac_mask2;
    /* 0x0395 */ uint64_t reserve_0395[0x0003];
    /* 0x0398 */ uint64_t wac_match3;
    /* 0x0399 */ uint64_t reserve_0399[0x0003];
    /* 0x039C */ uint64_t wac_mask3;
    /* 0x039D */ uint64_t reserve_039D[0x0003];
    /* 0x03A0 */ uint64_t wac_match4;
    /* 0x03A1 */ uint64_t reserve_03A1[0x0003];
    /* 0x03A4 */ uint64_t wac_mask4;
    /* 0x03A5 */ uint64_t reserve_03A5[0x0003];
    /* 0x03A8 */ uint64_t wac_match5;
    /* 0x03A9 */ uint64_t reserve_03A9[0x0003];
    /* 0x03AC */ uint64_t wac_mask5;
    /* 0x03AD */ uint64_t reserve_03AD[0x0003];
    /* 0x03B0 */ uint64_t wac_match6;
    /* 0x03B1 */ uint64_t reserve_03B1[0x0003];
    /* 0x03B4 */ uint64_t wac_mask6;
    /* 0x03B5 */ uint64_t reserve_03B5[0x0003];
    /* 0x03B8 */ uint64_t wac_match7;
    /* 0x03B9 */ uint64_t reserve_03B9[0x0003];
    /* 0x03BC */ uint64_t wac_mask7;
    /* 0x03BD */ uint64_t int_event_set;
    /* 0x03BE */ uint64_t int_event_clr;
    /* 0x03BF */ uint64_t reserve_03BF;
    /* 0x03C0 */ uint64_t wac_match8;
    /* 0x03C1 */ uint64_t reserve_03C1[0x0003];
    /* 0x03C4 */ uint64_t wac_mask8;
    /* 0x03C5 */ uint64_t reserve_03C5[0x0003];
    /* 0x03C8 */ uint64_t wac_match9;
    /* 0x03C9 */ uint64_t reserve_03C9[0x0003];
    /* 0x03CC */ uint64_t wac_mask9;
    /* 0x03CD */ uint64_t reserve_03CD[0x0003];
    /* 0x03D0 */ uint64_t wac_match10;
    /* 0x03D1 */ uint64_t reserve_03D1[0x0003];
    /* 0x03D4 */ uint64_t wac_mask10;
    /* 0x03D5 */ uint64_t reserve_03D5[0x0003];
    /* 0x03D8 */ uint64_t wac_match11;
    /* 0x03D9 */ uint64_t access_config;
    /* 0x03DA */ uint64_t wac_ttype_config;
    /* 0x03DB */ uint64_t reserve_03DB;
    /* 0x03DC */ uint64_t wac_mask11;
    /* 0x03DD */ uint64_t reserve_03DD[0x0003];
    /* 0x03E0 */ uint64_t thread0_wu_event_set;
    /* 0x03E1 */ uint64_t reserve_03E1[0x0003];
    /* 0x03E4 */ uint64_t thread0_wu_event_clr;
    /* 0x03E5 */ uint64_t reserve_03E5[0x0003];
    /* 0x03E8 */ uint64_t thread1_wu_event_set;
    /* 0x03E9 */ uint64_t reserve_03E9[0x0003];
    /* 0x03EC */ uint64_t thread1_wu_event_clr;
    /* 0x03ED */ uint64_t reserve_03ED[0x0003];
    /* 0x03F0 */ uint64_t thread2_wu_event_set;
    /* 0x03F1 */ uint64_t reserve_03F1[0x0003];
    /* 0x03F4 */ uint64_t thread2_wu_event_clr;
    /* 0x03F5 */ uint64_t reserve_03F5[0x0003];
    /* 0x03F8 */ uint64_t thread3_wu_event_set;
    /* 0x03F9 */ uint64_t reserve_03F9[0x0003];
    /* 0x03FC */ uint64_t thread3_wu_event_clr;
} wu_dcr_t;
  
#define WU_DCR_USER_PTR _DCR_USER_PTR(wu_dcr_t, WU_DCR)
#define WU_DCR_PRIV_PTR _DCR_PRIV_PTR(wu_dcr_t, WU_DCR)
  
#endif // !__ASSEMBLY__
  
__END_DECLS
  
#endif // add nothing below this line.
